# DirectContext3DHandleSettings Properties

---
The DirectContext3DHandleSettings type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Visibility|  Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Top
#### Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace